 var lang = 'ua';
    var step = 1;

    var translates = {
        ua: {
            1: 'Рейтинг кредитiв пiд 0.01%',
            2: 'Вік 18-80',
            3: 'Термін до 30 днів',
            4: 'Отримати гроші',
            5: 'Вік 18-89',
            6: 'Вік 18-65',
            7: 'Вік 18-70',
            8: 'Термін до 70 днів',
            9: 'Чи брали Ви раніше кредит',
            10: 'Так',
            11: 'Ні',
            12: 'Не впевнений',
            13: 'Далі',
            14: 'Заповніть заявку зараз, і гроші у вас',
            15: 'Послугу з пошуку кредитних пропозицій надає інформаційний сайт "КредитКіоск". Сайт не надає платні послуги з кредитних продуктів для клієнтів, а саме пропонує клієнту список пропозицій кредитних установ, некредитних фінансових організацій, до яких клієнт може звернутися з метою оформлення заявки на кредитний продукт. Проект не є банком або кредитором, не належить до фінансових установ і не несе відповідальності за наслідки будь-яких укладених договорів кредитування або поручительство перед ним. Мінімальна процентна ставка у деяких партнерів становить 0.01%. Щоб оформити заявку на отримання позики, необхідно заповнити анкету на сайті проекту. Здійснюючи будь-які дії на сайті, ви повинні надати свою Згоду на обробку персональних даних і Згоду на отримання рекламних матеріалів. Ви ознайомились та погоджуєтесь з Договором публічної оферти та Тарифами сервісу. Сервіс "Турбокеш" використовує кукі для надання послуг. Умови зберігання або доступу до кукі Ви можете налаштувати в своєму браузері. Сервіс призначений для осіб від 18 років. Розрахунок у калькуляторах, що наданий на сайті, базується на середньому показнику відсоткової ставки, яка буде запропонована вам фінансовими організаціями.',
            16: '"КредитКіоск", м. Київ, вул. Мишуги 32в',
            17: 'Скільки Вам років?',
            20: 'більше 50',
            21: 'На який термін вам потрібні гроші?',
            22: 'до 10 днів',
            23: '10 - 20 днів',
            24: '20-30 днів',
            25: 'підвищена ймовірність отримання кредиту',
            26: 'швидке отримання результату',
            27: '0.01% на день',
        },
        ru: {
            1: 'Рейтинг кредитов под 0,01%',
            2: 'Возраст 18-80',
            3: 'Срок до 30 дней',
            4: 'Получить деньги',
            5: 'Возраст 18-89',
            6: 'Возраст 18-65',
            7: 'Возраст 18-70',
            8: 'Срок до 70 дней',
            9: 'Брали ли Вы ранее кредит',
            10: 'Да',
            11: 'Нет',
            12: 'Не уверен',
            13: 'Дальше',
            14: 'Заполните заявку сейчас, и деньги у вас',
            15: 'Услугу по поиску кредитных предложений предоставляет информационный сайт "КредитКіоск". Сайт не предоставляет платные услуги по кредитным продуктам для клиентов, а именно предлагает клиенту список предложений кредитных учреждений, некредитных финансовых организаций, в которых клиент может обратиться для оформления заявки на кредитный продукт. Проект не является банком или кредитором, не относится к финансовым учреждениям и не несет ответственности за последствия любых заключенных договоров кредитования или поручительство перед ним. Минимальная процентная ставка в некоторых партнеров составляет 0.01%. Чтобы оформить заявку на получение займа, необходимо заполнить анкету на сайте проекта. Осуществляя любые действия на сайте, вы должны предоставить свою Согласие на обработку персональных данных и Согласие на получение рекламных материалов. Вы ознакомились и согласны с Договором публичной оферты и Тарифами сервиса. Сервис "Турбоком" использует куки для оказания услуг. Условия хранения или доступа к куки Вы можете настроить в своем браузере. Сервис предназначен для лиц старше 18 лет. Расчет в калькуляторах, предоставленный на сайте, базируется на среднем показателе процентной ставки, которая будет предложена вам финансовыми организациями.',
            16: '"КредитКіоск", г. Киев, ул. Мишуги 32в',
            17: 'Сколько вам лет?',
            20: 'больше 50',
            21: 'На какой срок вам нужны деньги?',
            22: 'до 10 дней',
            23: '10 - 20 дней',
            24: '20-30 дней',
            25: 'повышенная вероятность получения кредита',
            26: 'быстрое получение результата',
            27: '0.01% в день',
        }
    }



    // document.getElementById('language_switcher').addEventListener("click", function(event){
    //     lang = lang === 'ua' ? 'ru' : 'ua';

    //     if(lang === 'ua'){
    //         document.getElementById('switcher').classList.remove("position-left");
    //         document.getElementById('switcher').classList.add("position-right");
    //     }else {
    //         document.getElementById('switcher').classList.remove("position-right");
    //         document.getElementById('switcher').classList.add("position-left");
    //     }

    //     document.querySelectorAll('[data-key]').forEach((element) => {
    //         element.innerText = translates[lang][element.dataset.key];
    //     });
    // });
var arrLang = {
  'ua': {
    1: 'Рейтинг кредитiв пiд 0.01%',
            2: 'Вік <br> 18-80',
            3: 'Термін <br> до 30 днів',
            4: 'Отримати гроші',
            5: 'Вік <br> 18-89',
            6: 'Вік <br> 18-65',
            7: 'Вік <br> 18-70',
            8: 'Термін <br> до 70 днів',
            9: 'Заповніть заявку зараз, і гроші у вас',
            10: 'Послугу з пошуку кредитних пропозицій надає інформаційний сайт «ВашЗайм». Сайт не надає платні послуги з кредитних продуктів для клієнтів, а саме пропонує клієнту список пропозицій кредитних установ, некредитних фінансових організацій, до яких клієнт може звернутися з метою оформлення заявки на кредитний продукт. Проект не є банком або кредитором, не належить до фінансових установ і не несе відповідальності за наслідки будь-яких укладених договорів кредитування або поручительство перед ним. Мінімальна процентна ставка у деяких партнерів становить 0.01%. Щоб оформити заявку на отримання позики, необхідно заповнити анкету на сайті проекту. Здійснюючи будь-які дії на сайті, ви повинні надати свою Згоду на обробку персональних даних і Згоду на отримання рекламних матеріалів. Ви ознайомились та погоджуєтесь з Договором публічної оферти та Тарифами сервісу. Сервіс «ВашЗайм» використовує кукі для надання послуг. Умови зберігання або доступу до кукі Ви можете налаштувати в своєму браузері. Сервіс призначений для осіб від 18 років. Розрахунок у калькуляторах, що наданий на сайті, базується на середньому показнику відсоткової ставки, яка буде запропонована вам фінансовими організаціями.'
  },
  'ru': {
     1: 'Рейтинг кредитов под 0,01%',
            2: 'Возраст <br> 18-80',
            3: 'Срок <br> до 30 дней',
            4: 'Получить деньги',
            5: 'Возраст <br> 18-89',
            6: 'Возраст <br> 18-65',
            7: 'Возраст <br> 18-70',
            8: 'Срок <br> до 70 дней',
            9: 'Заполните заявку сейчас, и деньги у вас',
            10: 'Услуги по поиску кредитных предложений предоставляет информационный сайт "ВашЗайм". Сайт не предоставляет платные услуги по кредитным продуктам для клиентов, а предлагает клиенту список предложений кредитных учреждений, некредитных финансовых организаций, к которым клиент может обратиться с целью оформления заявки на кредитный продукт. Проект не является банком или кредитором, не пренадлежит к финансовым учреждениям и не несёт ответственность за последствия любых заключённых договоров кредитования либо поручительства перед ним. Минимальная процентная ставка у некоторых партнёров составляет 0,01%. Чтобы оформить заявку на получение заёма, необходимо заполнить анкету на сайте проекта. Выполняя любые действия на сайте, ви должны дать своё согласие на обработку персональных данных и согласие на получение рекламных материалов. Вы ознакомились и соглашаетесь с Договором публичной оферты и тарифами сервиса. Сервис "ВашЗайм" исспользует куки для предоставления услуг. Условия хранения или доступа к куки Вы можете настроить в соём браузере. Сервис предназначен для лиц от 18 лет. Расчёт в калькуляторах, которые предоставлены на сайте, базируется на среднем показателе процентной ставки, которая будет предложена вам финансовыми организациями.'
  }
}


 $(function() {
    $('.translate').click(function() {
      var lang = $(this).attr('id');

      $('.lang').each(function(index, item) {
        $(this).html(arrLang[lang][$(this).attr('key')]);
      });
    });
});

 $(document).on('click', '.language-img', function(){
    $(this).addClass('active').siblings().removeClass('active')
 })